//
//  PostsForPublic.swift
//  Navigation
//
//  Created by Igor Situn on 22.04.2022.
//

import Foundation

var post1 = Post(author: "Пробуждение...", description: "Выходя из берлоги, каждый уважающий себя медведь в первую очередь приводит себя в порядок. Этот – совсем недавно проснулся. Он тщательно трется о снег, чтобы очистить свою шубу. Глядя на эти грязные пятна, можно представить, каким он вышел из берлоги, ведь ее стенки, пол и потолок из земли, а медведь провел там несколько месяцев.Именно по таким следам на белоснежном склоне найти недавно покинутую медведем берлогу бывает совсем не трудно.", image: "4", likes: 1, views: 10)
var post2 = Post(author: "Первая встреча...", description: "А вот и первый медведь! Как же приятно после зимы его встретить! Да еще и среди красоты Долины гейзеров! Уже утром стало понятно по следам, что какой-то медведь спустился в Долину. Пошли вниз, и точно – вот он!Не придавая никакого значения летающему неподалеку дрону, шум от которого хорошо глушила река, медведик растянулся на теплой земле досыпать, так как проснулся он для этих мест рановато.", image: "3", likes: 2, views: 20)
var post3 = Post(author: "Про когти...", description: "Когти – это основное оружие и орудие медведя. Они помогают животному нападать и защищаться, добывать пропитание и копать берлоги, виртуозно разделывать рыбу и удерживаться на крутых склонах. Когтистой лапой удобно чесать разные места на медвежьем теле, а если светит солнце, то вот так прикрыться от яркого света))", image: "2", likes: 3, views: 30)
var post4 = Post(author: "О подушках...", description: "Правильная подушка – залог здорового сна медведика и его хорошего настроения!))Об этом знают все медведи в Южно-Камчатском заказнике. Поэтому и спят, если не в «гнездах», то хотя бы подкладывая под голову все, что для этого годится)).", image: "1", likes: 4, views: 40)
var posts = [post1, post2, post3, post4]
